import requests
import time
from crawler import Crawler

def send_requests(base_url, keywords):
    result = []
    success = 0
    failed = 0
    for i in range(len(keywords)):
        url = f"{base_url}?keyword={keywords[i]}"
        response = requests.get(url)
        total = 0

        if response.status_code == 200:
            result.append(response.text)
            total+=1
            print(f'{total} keyword :{keyword[i]}, Successed')
            success+=1
            # time.sleep(1)
        else:
            total +=1
            result.append(f"{total} Request {i + 1}: Failed - Status Code: {response.status_code}")
            failed+=1
            # time.sleep(1)
            
    print(result)
    print(str(len(result))+'중 성공률'+str(success/len(result)))
    return result


def send_api(keywords):
    crawler = Crawler()
    results = []
    total = 0
    for keyword in keywords:
        result = crawler.GetData(keyword)
        results.append(result)
        total+=1
        print(f'{total}  {result}')
        # time.sleep(2)

    return results
if __name__ == "__main__":
    base_url = "http://localhost:8001/search/"
    keyword = ["단어",'카페인','함장','합참','군대','양구','포스코','취업','청창사',
               '사과', '바나나', '복숭아', '포도', '오렌지', '딸기', '체리', '자두', '키위', '배',
                '수박', '메론', '파인애플', '레몬', '라임', '살구', '블루베리', '아보카도', '감', '참외',
                '망고', '밤', '토마토', '파파야', '자몽', '귤', '감귤', '포도', '패션후르츠', '살구', '두리안',
                '석류', '아로니아', '키위', '시원과', '모과', '레드향', '무화과', '산딸기', '곶감', '톤끼', '딸기',
                '애플망고', '홍시', '복분자', '미나리', '배', '아미야', '화이트포도', '멜론', '라즈베리', '파파야',
                '양파', '대추', '석류', '무화과', '국화','장미', '튤립', '백합', '국화', '안개꽃', '무궁화', '개나리', '코스모스', '매화', '해바라기',
                '튤립', '달리아', '카네이션', '해바라기', '제비꽃', '데이지', '프리지아', '라벤더', '스위트피', '국화',
                '수국', '수련', '동백', '자스민', '계단꽃', '왕벚나무', '베고니아', '하이비스커스', '라넌큘러스', '모란',
                '진달래', '한련화', '계수나무', '산수유', '솔잎나무', '메타세쿼이아', '목련', '실버버튼', '수달', '홍길',
                '달무리', '안개꽃', '수련', '밤', '산수유', '패란', '제비꽃', '마가렛', '스위트피', '라넌큘러스', '한련화',
                '동백', '패란', '라벤더', '왕벚나무', '코스모스', '상아수야', '무궁화', '국화', '양귀비', '프리지아',
                '카네이션', '다알리아', '메타세쿼이아', '베고니아', '샤스타', '솔잎나무', '벚나무', '진달래', '카모마일', '레이디핑크',
                '홍길', '장미','책', '펜', '노트북', '휴대폰', '의자', '테이블', '컴퓨터', '신발', '가방', '자동차',
                '커피머신', '텔레비전', '냉장고', '전자레인지', '선풍기', '에어컨', '세탁기', '건조기', '모니터', '키보드',
                '마우스', '스마트워치', '블루투스 스피커', '냄비', '프라이팬', '식기세척기', '청소기', '계란', '우유', '과자',
                '초콜릿', '과일', '야채', '수건', '칫솔', '치약', '샴푸', '린스', '비누', '세제', '휴지', '칼', '가위',
                '발찌', '귀걸이', '시계', '목걸이', '안경', '모자', '양말', '장갑', '티셔츠', '청바지', '원피스', '스커트',
                '수영복', '비키니', '양산', '우산', '컵', '접시', '수저', '포크', '나이프', '젓가락', '텀블러', '밥솥',
                '전기포트', '밥숟가락', '젓갈', '케이크', '케첩', '머스타드', '소금', '후추', '설탕', '생수', '음료수',
                '콜라', '사이다', '차', '우유', '주스', '맥주', '소주', '와인', '꽃병', '화분', '초', '향수', '샤워젤',
                '바디로션', '선글라스', '카드지갑', '종이지갑', '지갑', '머그컵', '커피잔', '찻잔', '스푼', '호스', '양말',
                '건전지', '휴대폰 충전기', '노트북 충전기', '헤어드라이어', '카메라', '빔프로젝터', '면도기', '우산', '스키',
                '스노보드', '텐트', '방수 팬츠', '담요', '손목 시계', '벨트', '운동화', '가발', '청소용품', '전자 담배',
                '안마기', '먹물', '인형', '비디오 게임', '보드게임', '운동기구', '헬스기구', '건강 보조제', '화장품', '의약품',
                '의료기기', '휴대폰 케이스', '노트북 케이스', '신문', '잡지', '서적', '과자', '젤리', '사탕', '초콜릿', '김밥',
                '라면', '샌드위치', '피자', '스테이크', '초밥', '햄버거', '타코', '샐러드','김밥', '라면', '떡볶이', '순대', '어묵', '만두', '냉면', '비빔밥', '불고기', '갈비', 
                '삼겹살', '햄버거', '치킨', '피자', '파스타', '스테이크', '초밥', '샤시미', '우동', '소바',
                '우동', '소바', '라멘', '오코노미야끼', '타코야끼', '유부초밥', '야끼소바', '해물파전', '팟타이', '푸딩',
                '마카롱', '크로와상', '도넛', '와플', '아이스크림', '딸기케이크', '초콜릿케이크', '치즈케이크', '타르트',
                '빵', '케이크', '크림빵', '피자빵', '단팥빵', '호빵', '바게트', '크로와상', '브리오슈', '머핀',
                '샌드위치', '핫도그', '샐러드', '스프', '짜장면', '짬뽕', '탕수육', '볶음밥', '고추잡채', '마파두부',
                '꿔바로우', '연탄꼬치', '탄탄면', '마라탕', '마라샹궈', '뚝배기불고기', '훠궈', '짜조', '꼬치', '닭발',
                '닭꼬치', '보쌈', '족발', '치즈퐁듀', '편육', '물회', '해물찜', '곱창', '대창', '막창', '삼겹살',
                '생선구이', '양념치킨', '감자튀김', '샐러드', '스프', '김치찌개', '된장찌개', '부대찌개', '전', '갈비탕',
                '설렁탕', '감자탕', '뼈해장국', '육개장', '순두부찌개', '물냉면', '비빔냉면', '잔치국수', '칼국수',
                '막국수', '쫄면', '물만두', '물동동', '물밀면', '치즈라면', '짜파게티', '열무냉면', '열무국수', '비빔국수',
                '삼각김밥', '자장면', '짜장면', '짬뽕', '마파두부', '짜조', '볶음밥', '깐풍기', '탕수육', '불고기',
                '불닭볶음면', '짜파게티', '엽떡', '떡국', '떡볶이', '튀김', '김밥', '순대', '어묵', '냉면', '갈비',
                '삼겹살', '치킨', '피자', '햄버거', '샐러드', '스프', '만두', '토스트', '핫도그', '오므라이스', '김치볶음밥',
                '된장찌개', '부대찌개', '순두부찌개', '청국장', '김치찌개', '감자탕', '설렁탕', '갈비탕', '된장국', '고추장찌개',
                '후라이드치킨', '양념치킨', '마라탕', '마라샹궈', '팟타이', '짜조', '닭발', '닭꼬치', '감자튀김', '치즈퐁듀',
                '라멘', '우동', '소바', '나베', '샤브샤브', '오꼬노미야끼','망치', '드라이버', '톱', '좌식톱', '톱날', '본딩톱', '스크류드라이버', '드릴', '전동드릴', '나사',
                '스크류', '못', '못박기', '절단기', '각도절단기', '전동톱', '빗살절단기', '젯식절단기', '톱날', '야금톱',
                '벤치톱', '테이블손톱', '로타리톱', '로타리톱날', '인코너절단기', '터치나일', '노치나일', '소켓나일', '목죄기',
                '자주식목죄기', '벤치죄기', '벤치모터죄기', '롤러죄기', '반자동죄기', '수평측정기', '수평', '레벨', '레이저수평측정기',
                '수평교정기', '범퍼', '상하조절기', '눈금막대', '눈금봉', '접는자', '두께재', '바퀴', '스크류못', '앵커못',
                '스파이크못', '다이아못', '송곳', '송곳죄기', '돌키', '타공기', '타공못', '타공소켓', '비트', '비트홀더', '비트키',
                '드릴비트', '스테핑비트', '홈페이지', '포스트홀더', '포스트홀더비트', '젯나스드릴', '비트교환기', '비트커버', '조인트드릴',
                '델타드릴', '드릴아답터', '드릴연장기', '드릴안드래그', '드릴버스컷', '드릴링버스컷', '포스터링바', '포스터링비트', '솔드링',
                '플러그렌치', '홀솔드링', '소켓렌치', '뻬인치', '클래프', '클램프', '벤치클램프', '그립클램프', '스타블록', '포스터클램프',
                '버블', '버블레벨', '스피릿', '마모닉스피릿', '라인레벨', '레이저스피릿', '속옷', '미터측정밴드', '피브씨', '피브',
                '측정테이프', '룰러', '마스킹테이프', '마스킹', '테이프', '저항대', '수직측정기', '수직레벨', '수직', '스케일',
                '룰렛', '마스킹포인트', '프레임스케일', '프레임룰렛', '인크라이트', '소프트룰렛', '하드룰렛', '저항대', '인크라이트',
                '마킹가이드', '도장', '배럴도장', '유니버설도장', '배럴유니버설도장', '눈금도장', '실린더도장', '타원도장', '이월도장',
                '비트도장', '앵커도장', '프레임도장', '프레임비트도장', '도미노', '도미노조인터', '도미노피스', '도미노테이퍼', '모델링도미노',
                '도미노셀프시스템', '라우터', '트리머', '엣지링', '필러트비트', '베어링비트', '모타비트', '고주파비트', '템플릿비트', '피니셔비트',
                '쉐비트', '델타비트', '예비비트', '가이드비트', '터비트', '아르츠비트', '트리바이트', '커터', '로터리커터', '디크터',
                '로터리디크터', '리벳커터', '슬리트커터', '링커터', '링커터안내링', '스퀘어커터', '링커터', '플라이커터', '원커터', '초크커터',
                '판커터']

    # send_requests(base_url, keyword)
for _ in range(3):
    send_api(keywords=keyword)
